{
  "welcome": {
    "title": "Benvenuto in MCParr",
    "subtitle": "Il tuo gateway IA per controllare l'homelab",
    "description": "MCParr centralizza il controllo di tutti i servizi del tuo homelab attraverso un'interfaccia conversazionale basata su IA.",
    "skipGuide": "Salta la guida",
    "startConfiguration": "Avvia configurazione",
    "importConfiguration": "Importa configurazione",
    "or": "oppure",
    "guideInfo": "Questa guida ti accompagna nella configurazione iniziale. Potrai modificare tutte queste impostazioni in seguito.",
    "features": {
      "services": "Gestione servizi",
      "users": "Gestione utenti",
      "chains": "Catene di risposta",
      "help": "Aiuto integrato",
      "mcp": "Server MCP integrato",
      "dashboard": "Dashboard e monitoraggio",
      "training": "Addestramento IA",
      "permissions": "Gestione permessi"
    },
    "import": {
      "selectFile": "Clicca per selezionare un file",
      "jsonOnly": "Solo .json",
      "version": "Versione",
      "unknownDate": "Data sconosciuta",
      "mergeMode": "Modalità unione",
      "mergeDescription": "Unisci con esistenti",
      "importButton": "Importa configurazione",
      "importing": "Importazione...",
      "success": "Importazione completata! Passaggio al passo successivo...",
      "failed": "Importazione completata con errori",
      "errors": "errore/i",
      "cancel": "Annulla",
      "continueAnyway": "Continua comunque",
      "categories": {
        "services": "Servizi",
        "users": "Utenti",
        "groups": "Gruppi",
        "config": "Config",
        "ai": "IA"
      }
    }
  },
  "complete": {
    "title": "Configurazione completata!",
    "subtitle": "MCParr è pronto all'uso",
    "nextStepsTitle": "Prossimi passi consigliati",
    "accessDashboard": "Accedi al Dashboard",
    "guideInfo": "Puoi accedere a questa guida in qualsiasi momento da",
    "guideLocation": "Configurazione → Generale → Reimposta guida",
    "steps": {
      "configureServices": "Configura i servizi",
      "mapUsers": "Mappa gli utenti",
      "createGroups": "Crea i gruppi",
      "testAI": "Testa l'interfaccia IA"
    }
  },
  "steps": {
    "services": {
      "title": "Servizi Homelab",
      "subtitle": "Connetti le tue applicazioni",
      "description": "Configura i servizi homelab che MCParr controllerà. Per ogni servizio, inserisci l'URL, la chiave API (o nome utente e password a seconda del servizio), e opzionalmente un URL esterno per l'accesso remoto. Testa ogni servizio singolarmente o tutti insieme.",
      "linkText": "Configura servizi",
      "tip": "Nella scheda Gruppi della pagina Servizi, puoi creare gruppi di servizi (es. Media con Plex, Tautulli, Overseerr) che verranno usati come endpoint di strumenti per Open WebUI.",
      "steps": [
        "Accedi alla pagina Servizi tramite il menu di navigazione",
        "Clicca su \"Aggiungi un servizio\" e inserisci URL, chiave API o credenziali",
        "Configura l'URL esterno se vuoi accedere al servizio da remoto",
        "Testa la connessione (singolarmente o tutti i servizi)",
        "Crea gruppi di servizi nella scheda Gruppi per organizzare i tuoi endpoint"
      ]
    },
    "users": {
      "title": "Mappatura utenti",
      "subtitle": "Collega i tuoi account tra i servizi",
      "description": "La mappatura utenti permette a MCParr di sapere quale account in Plex corrisponde allo stesso utente in Overseerr, Radarr, ecc. Questo abilita la gestione dei permessi e l'accesso agli strumenti MCP.",
      "linkText": "Mappa utenti",
      "tip": "Il rilevamento automatico funziona meglio con almeno 2 servizi configurati che hanno utenti.",
      "steps": [
        "Accedi alla pagina Utenti tramite il menu",
        "Utilizza la scheda \"Rilevamento automatico\" per scansionare i servizi",
        "Valida i suggerimenti o crea mappature manuali"
      ]
    },
    "groups": {
      "title": "Gruppi e permessi",
      "subtitle": "Controlla l'accesso agli strumenti MCP",
      "description": "I gruppi definiscono quali strumenti MCP (Model Context Protocol) sono accessibili ai tuoi utenti. Ad esempio, un gruppo 'Admin' potrebbe avere accesso a tutti gli strumenti, mentre un gruppo 'Utente' avrebbe accesso solo agli strumenti di sola lettura.",
      "linkText": "Gestisci gruppi",
      "tip": "Gli strumenti MCP permettono all'IA di interagire con i servizi. I permessi controllano cosa può fare ogni gruppo.",
      "steps": [
        "Accedi alla pagina Gruppi tramite il menu",
        "Crea gruppi (Admin, Utente, Famiglia...) con \"Crea gruppo\"",
        "Assegna i permessi MCP a ogni gruppo",
        "Assegna gli utenti ai gruppi appropriati"
      ]
    },
    "mcp": {
      "title": "Server MCP",
      "subtitle": "Model Context Protocol",
      "description": "Il server MCP permette alla tua IA di interagire con i servizi dell'homelab. Visualizza la cronologia delle chiamate, testa gli strumenti direttamente dall'interfaccia, configura gli strumenti in Open WebUI e gestisci la ricerca globale.",
      "linkText": "Visualizza configurazione MCP",
      "tip": "Usa la scheda Configurazione per configurare gli strumenti direttamente in Open WebUI (se il servizio è correttamente configurato) e per impostare la ricerca globale.",
      "steps": [
        "Visualizza la cronologia delle chiamate MCP nella scheda Cronologia",
        "Testa gli strumenti direttamente dalla scheda Strumenti",
        "Configura gli strumenti per Open WebUI nella scheda Configurazione",
        "Imposta la Ricerca Globale per cercare in tutti i tuoi servizi"
      ]
    },
    "chains": {
      "title": "Catene di strumenti",
      "subtitle": "Automatizza i tuoi flussi di lavoro",
      "description": "Le catene di strumenti permettono di creare sequenze di azioni automatizzate. Questo alleggerisce la logica che il modello IA deve gestire, definendo risposte e sequenze basate su configurazioni specifiche.",
      "linkText": "Gestisci catene",
      "tip": "Una catena ben configurata permette al modello IA di delegare flussi di lavoro complessi mantenendo un controllo preciso sui passaggi.",
      "steps": [
        "Accedi alla pagina MCP, scheda Catene",
        "Crea una nuova catena con gli strumenti desiderati",
        "Definisci condizioni di attivazione e parametri",
        "Configura risposte automatiche e sequenze"
      ]
    },
    "training": {
      "title": "Addestramento IA",
      "subtitle": "Personalizza il tuo assistente",
      "description": "Il modulo di addestramento ti permette di addestrare e personalizzare il tuo assistente IA in base alle tue preferenze e al tuo utilizzo. Crea prompt personalizzati e ottimizza il comportamento dell'IA.",
      "linkText": "Accedi all'addestramento",
      "tip": "I prompt personalizzati ti permettono di adattare il comportamento dell'IA alle tue esigenze specifiche e al tuo stile di interazione.",
      "steps": [
        "Esamina i prompt di sistema attuali",
        "Crea i tuoi prompt personalizzati per compiti specifici",
        "Testa e affina le risposte dell'IA",
        "Gestisci la cronologia e gli esempi di addestramento"
      ]
    },
    "monitoring": {
      "title": "Monitoraggio",
      "subtitle": "Monitora il tuo sistema",
      "description": "Il monitoraggio ti permette di seguire in tempo reale lo stato dei servizi, le prestazioni del sistema e la cronologia delle interazioni IA. Rileva rapidamente i problemi e ottimizza la tua infrastruttura.",
      "linkText": "Visualizza monitoraggio",
      "tip": "Il monitoraggio proattivo aiuta a identificare e risolvere i problemi prima che impattino gli utenti.",
      "steps": [
        "Controlla il dashboard di monitoraggio in tempo reale",
        "Verifica lo stato di salute di ogni servizio",
        "Analizza le metriche di prestazione (CPU, RAM, rete)",
        "Configura gli avvisi per essere notificato dei problemi"
      ]
    },
    "config": {
      "title": "Configurazione",
      "subtitle": "Personalizza MCParr",
      "description": "La pagina di configurazione centralizza tutte le impostazioni dell'applicazione: aspetto, notifiche, log, dashboard e backup. Personalizza MCParr secondo le tue preferenze ed esporta la configurazione.",
      "linkText": "Apri configurazione",
      "tip": "Ricordati di esportare regolarmente la configurazione per poterla ripristinare facilmente se necessario.",
      "steps": [
        "Regola il tema (chiaro, scuro, sistema)",
        "Configura notifiche e avvisi",
        "Imposta il livello di log e l'aggiornamento automatico",
        "Esporta/importa la configurazione per il backup"
      ]
    },
    "help": {
      "title": "Sistema di aiuto",
      "subtitle": "Documentazione integrata",
      "description": "MCParr dispone di un sistema di aiuto integrato accessibile su ogni pagina tramite l'icona di aiuto (?). La pagina Aiuto centralizza tutta la documentazione disponibile del sito per una consultazione rapida.",
      "linkText": "Visualizza Aiuto",
      "tip": "Clicca sull'icona ? su ogni pagina per accedere all'aiuto contestuale di quella sezione.",
      "steps": [
        "Cerca l'icona di aiuto (?) nelle diverse pagine",
        "Cliccala per visualizzare l'aiuto contestuale",
        "Accedi alla pagina Aiuto per vedere tutta la documentazione",
        "Usa la ricerca per trovare informazioni rapidamente"
      ]
    }
  },
  "navigation": {
    "previous": "Precedente",
    "next": "Successivo",
    "tipLabel": "Suggerimento:"
  },
  "progress": {
    "stepLabels": {
      "services": "servizi",
      "users": "utenti",
      "groups": "gruppi",
      "mcp": "mcp",
      "chains": "catene",
      "training": "addestramento",
      "monitoring": "monitoraggio",
      "config": "config",
      "help": "aiuto"
    }
  }
}
