{
  "welcome": {
    "title": "Bienvenue sur MCParr",
    "subtitle": "Votre gateway IA pour contrôler votre homelab",
    "description": "MCParr centralise le contrôle de tous vos services homelab via une interface conversationnelle alimentée par l'IA.",
    "skipGuide": "Passer le guide",
    "startConfiguration": "Commencer la configuration",
    "importConfiguration": "Importer une configuration",
    "or": "ou",
    "guideInfo": "Ce guide vous accompagne dans la configuration initiale. Vous pourrez modifier tous ces paramètres ultérieurement.",
    "features": {
      "services": "Gestion des services",
      "users": "Gestion des utilisateurs",
      "chains": "Chaînes de réponse",
      "help": "Aide intégrée",
      "mcp": "Serveur MCP intégré",
      "dashboard": "Dashboard & monitoring",
      "training": "AI Training",
      "permissions": "Gestion des permissions"
    },
    "import": {
      "selectFile": "Cliquer pour selectionner un fichier",
      "jsonOnly": ".json uniquement",
      "version": "Version",
      "unknownDate": "Date inconnue",
      "mergeMode": "Mode fusion",
      "mergeDescription": "Fusionner avec existant",
      "importButton": "Importer la configuration",
      "importing": "Import en cours...",
      "success": "Import reussi ! Passage a l'etape suivante...",
      "failed": "Import termine avec des erreurs",
      "errors": "erreur(s)",
      "cancel": "Annuler",
      "continueAnyway": "Continuer quand meme",
      "categories": {
        "services": "Services",
        "users": "Users",
        "groups": "Groupes",
        "config": "Config",
        "ai": "AI"
      }
    }
  },
  "complete": {
    "title": "Configuration terminée !",
    "subtitle": "MCParr est prêt à être utilisé",
    "nextStepsTitle": "Prochaines étapes recommandées",
    "accessDashboard": "Accéder au Dashboard",
    "guideInfo": "Vous pouvez retrouver ce guide à tout moment depuis",
    "guideLocation": "Configuration → General → Réinitialiser le guide",
    "steps": {
      "configureServices": "Configurez vos services",
      "mapUsers": "Mappez vos utilisateurs",
      "createGroups": "Créez des groupes",
      "testAI": "Testez l'interface IA"
    }
  },
  "steps": {
    "services": {
      "title": "Services Homelab",
      "subtitle": "Connectez vos applications",
      "description": "Configurez les services de votre homelab que MCParr pourra contrôler. Pour chaque service, renseignez son URL, sa clé API (ou nom d'utilisateur et mot de passe selon les services), et optionnellement une URL externe pour l'accès distant. Testez chaque service individuellement ou tous en même temps.",
      "linkText": "Configurer les services",
      "tip": "Dans l'onglet Groupes de la page Services, vous pouvez créer des groupes de services (ex: Media avec Plex, Tautulli, Overseerr) qui seront utilisés comme endpoints tools pour Open WebUI.",
      "steps": [
        "Accédez à la page Services via le menu de navigation",
        "Cliquez sur \"Ajouter un service\" et renseignez URL, clé API ou identifiants",
        "Configurez l'URL externe si vous souhaitez accéder au service à distance",
        "Testez la connexion (individuellement ou tous les services)",
        "Créez des groupes de services dans l'onglet Groupes pour organiser vos endpoints"
      ]
    },
    "users": {
      "title": "Mapping Utilisateurs",
      "subtitle": "Associez vos comptes entre services",
      "description": "Le mapping des utilisateurs permet à MCParr de savoir quel compte dans Plex correspond au même utilisateur dans Overseerr, Radarr, etc. Cela permet de gérer les permissions et l'accès aux outils MCP.",
      "linkText": "Mapper les utilisateurs",
      "tip": "La détection automatique fonctionne mieux avec au moins 2 services configurés ayant des utilisateurs.",
      "steps": [
        "Accédez à la page Users via le menu",
        "Utilisez l'onglet \"Auto Detection\" pour scanner vos services",
        "Validez les suggestions ou créez des mappings manuels"
      ]
    },
    "groups": {
      "title": "Groupes & Permissions",
      "subtitle": "Contrôlez l'accès aux outils MCP",
      "description": "Les groupes définissent quels outils MCP (Model Context Protocol) sont accessibles à vos utilisateurs. Par exemple, un groupe 'Admin' pourrait avoir accès à tous les outils, tandis qu'un groupe 'User' n'aurait accès qu'aux outils de consultation.",
      "linkText": "Gérer les groupes",
      "tip": "Les outils MCP permettent à l'IA d'interagir avec vos services. Les permissions contrôlent ce que chaque groupe peut faire.",
      "steps": [
        "Accédez à la page Groups via le menu",
        "Créez des groupes (Admin, User, Family...) avec \"Create Group\"",
        "Assignez les permissions MCP à chaque groupe",
        "Assignez vos utilisateurs aux groupes appropriés"
      ]
    },
    "mcp": {
      "title": "Serveur MCP",
      "subtitle": "Model Context Protocol",
      "description": "Le serveur MCP permet à votre IA d'interagir avec vos services homelab. Visualisez l'historique des appels, testez les outils directement depuis l'interface, configurez les tools dans Open WebUI, et gérez la recherche globale.",
      "linkText": "Voir la configuration MCP",
      "tip": "Utilisez l'onglet Config pour configurer les tools directement dans Open WebUI (si le service est bien configuré) et pour paramétrer la recherche globale.",
      "steps": [
        "Consultez l'historique des appels MCP dans l'onglet History",
        "Testez les outils directement depuis l'onglet Tools",
        "Configurez les tools pour Open WebUI dans l'onglet Config",
        "Paramétrez la Recherche Globale pour chercher dans tous vos services"
      ]
    },
    "chains": {
      "title": "Chaînes de Tools",
      "subtitle": "Automatisez vos workflows",
      "description": "Les chaînes de tools permettent de créer des séquences d'actions automatisées. Cela allège la logique que le modèle IA doit gérer en définissant des réponses et enchaînements selon des configurations spécifiques.",
      "linkText": "Gérer les chaînes",
      "tip": "Une chaîne bien configurée permet au modèle IA de déléguer des workflows complexes tout en gardant un contrôle précis sur les étapes.",
      "steps": [
        "Accédez à la page MCP, onglet Chains",
        "Créez une nouvelle chaîne avec les outils souhaités",
        "Définissez les conditions de déclenchement et les paramètres",
        "Configurez les réponses et enchaînements automatiques"
      ]
    },
    "training": {
      "title": "Training IA",
      "subtitle": "Personnalisez votre assistant",
      "description": "Le module de training permet d'entraîner et de personnaliser votre assistant IA en fonction de vos préférences et de votre utilisation. Créez des prompts personnalisés et affinez le comportement de l'IA.",
      "linkText": "Accéder au Training",
      "tip": "Les prompts personnalisés permettent d'adapter le comportement de l'IA à vos besoins spécifiques et à votre style d'interaction.",
      "steps": [
        "Consultez les prompts système actuels",
        "Créez vos propres prompts personnalisés pour des tâches spécifiques",
        "Testez et affinez les réponses de l'IA",
        "Gérez l'historique et les exemples d'entraînement"
      ]
    },
    "monitoring": {
      "title": "Monitoring",
      "subtitle": "Surveillez votre système",
      "description": "Le monitoring vous permet de surveiller en temps réel l'état de vos services, les performances du système, et l'historique des interactions avec l'IA. Détectez rapidement les problèmes et optimisez votre infrastructure.",
      "linkText": "Voir le Monitoring",
      "tip": "Le monitoring proactif vous aide à identifier et résoudre les problèmes avant qu'ils n'impactent vos utilisateurs.",
      "steps": [
        "Consultez le dashboard de monitoring en temps réel",
        "Vérifiez l'état de santé de chaque service",
        "Analysez les métriques de performance (CPU, RAM, réseau)",
        "Configurez des alertes pour être notifié des problèmes"
      ]
    },
    "config": {
      "title": "Configuration",
      "subtitle": "Personnalisez MCParr",
      "description": "La page de configuration centralise tous les paramètres de l'application : apparence, notifications, logs, dashboard, et sauvegarde. Personnalisez MCParr selon vos préférences et exportez votre configuration.",
      "linkText": "Ouvrir la Configuration",
      "tip": "Pensez à exporter régulièrement votre configuration pour pouvoir la restaurer facilement en cas de besoin.",
      "steps": [
        "Ajustez le thème (clair, sombre, système)",
        "Configurez les notifications et alertes",
        "Définissez le niveau de logs et l'actualisation automatique",
        "Exportez/importez votre configuration pour la sauvegarder"
      ]
    },
    "help": {
      "title": "Système d'Aide",
      "subtitle": "Documentation intégrée",
      "description": "MCParr dispose d'un système d'aide intégré accessible sur chaque page via l'icône d'aide (?). La page Aide centralise toutes les aides disponibles du site pour une consultation rapide.",
      "linkText": "Consulter l'Aide",
      "tip": "Cliquez sur l'icône ? présente sur chaque page pour accéder à l'aide contextuelle de cette section.",
      "steps": [
        "Repérez l'icône d'aide (?) sur les différentes pages",
        "Cliquez dessus pour afficher l'aide contextuelle",
        "Accédez à la page Aide pour voir toutes les documentations",
        "Utilisez la recherche pour trouver rapidement une information"
      ]
    }
  },
  "navigation": {
    "previous": "Précédent",
    "next": "Suivant",
    "tipLabel": "Astuce :"
  },
  "progress": {
    "stepLabels": {
      "services": "services",
      "users": "users",
      "groups": "groupes",
      "mcp": "mcp",
      "chains": "chaînes",
      "training": "training",
      "monitoring": "monitoring",
      "config": "config",
      "help": "aide"
    }
  }
}
